nxp-mcuxpresso/mcux-sdk/devices/LPC5516/LPC5516.h
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_FIELD_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_FIELD_SHIFT (0U)
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_FIELD(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_FIELD_SHIFT)) & FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3 */
#define FLASH_NMPA_NXP_DEVICE_CERTIFICATE_3_COUNT (4U)

/*! @name SHA256_DIGEST - SHA-256 DIGEST (9EC00 - 9FDBC) ROM Patch Area + NXP Area (IMPORTANT NOTE: Pages used for Repair (N-8 to N-3) are excluded from the computation) SHA256_DIGEST0 for DIGEST[31:0]..SHA-256 DIGEST (9EC00 - 9FDBC) ROM Patch Area + NXP Area (IMPORTANT NOTE: Pages used for Repair (N-8 to N-3) are excluded from the computation) SHA256_DIGEST7 for DIGEST[255:224] */
/*! @{ */

#define FLASH_NMPA_SHA256_DIGEST_FIELD_MASK      (0xFFFFFFFFU)
#define FLASH_NMPA_SHA256_DIGEST_FIELD_SHIFT     (0U)
#define FLASH_NMPA_SHA256_DIGEST_FIELD(x)        (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_SHA256_DIGEST_FIELD_SHIFT)) & FLASH_NMPA_SHA256_DIGEST_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_SHA256_DIGEST */
#define FLASH_NMPA_SHA256_DIGEST_COUNT           (8U)

/*! @name ECID_BACKUP_0 -  */
/*! @{ */

#define FLASH_NMPA_ECID_BACKUP_0_COORD_Y_MASK    (0xFFFFU)
#define FLASH_NMPA_ECID_BACKUP_0_COORD_Y_SHIFT   (0U)
#define FLASH_NMPA_ECID_BACKUP_0_COORD_Y(x)      (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_ECID_BACKUP_0_COORD_Y_SHIFT)) & FLASH_NMPA_ECID_BACKUP_0_COORD_Y_MASK)

#define FLASH_NMPA_ECID_BACKUP_0_COORD_X_MASK    (0xFFFF0000U)
#define FLASH_NMPA_ECID_BACKUP_0_COORD_X_SHIFT   (16U)
#define FLASH_NMPA_ECID_BACKUP_0_COORD_X(x)      (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_ECID_BACKUP_0_COORD_X_SHIFT)) & FLASH_NMPA_ECID_BACKUP_0_COORD_X_MASK)
/*! @} */

/*! @name ECID_BACKUP_1 -  */
/*! @{ */

#define FLASH_NMPA_ECID_BACKUP_1_WAFER_MASK      (0xFFU)
#define FLASH_NMPA_ECID_BACKUP_1_WAFER_SHIFT     (0U)
#define FLASH_NMPA_ECID_BACKUP_1_WAFER(x)        (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_ECID_BACKUP_1_WAFER_SHIFT)) & FLASH_NMPA_ECID_BACKUP_1_WAFER_MASK)
/*! @} */

/*! @name ECID_BACKUP_2 -  */
/*! @{ */

#define FLASH_NMPA_ECID_BACKUP_2_LOTID_LSB_MASK  (0xFFFFFFFFU)
#define FLASH_NMPA_ECID_BACKUP_2_LOTID_LSB_SHIFT (0U)
#define FLASH_NMPA_ECID_BACKUP_2_LOTID_LSB(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_ECID_BACKUP_2_LOTID_LSB_SHIFT)) & FLASH_NMPA_ECID_BACKUP_2_LOTID_LSB_MASK)
/*! @} */

/*! @name ECID_BACKUP_3 -  */
/*! @{ */

#define FLASH_NMPA_ECID_BACKUP_3_LOTID_MSB_MASK  (0xFFFFFFFFU)
#define FLASH_NMPA_ECID_BACKUP_3_LOTID_MSB_SHIFT (0U)
#define FLASH_NMPA_ECID_BACKUP_3_LOTID_MSB(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_ECID_BACKUP_3_LOTID_MSB_SHIFT)) & FLASH_NMPA_ECID_BACKUP_3_LOTID_MSB_MASK)
/*! @} */

/*! @name ECID_BACKUP_ARRAY - ECID backup (the original is in page n-1) */
/*! @{ */

#define FLASH_NMPA_ECID_BACKUP_ARRAY_FIELD_MASK  (0xFFFFFFFFU)
#define FLASH_NMPA_ECID_BACKUP_ARRAY_FIELD_SHIFT (0U)
#define FLASH_NMPA_ECID_BACKUP_ARRAY_FIELD(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_ECID_BACKUP_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_ECID_BACKUP_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_ECID_BACKUP_ARRAY */
#define FLASH_NMPA_ECID_BACKUP_ARRAY_COUNT       (4U)

/* The count of FLASH_NMPA_CHECKSUM */
#define FLASH_NMPA_CHECKSUM_COUNT                (4U)

/*! @name DIS_ROM_HIDING -  */
/*! @{ */

#define FLASH_NMPA_DIS_ROM_HIDING_DIS_ROM_HIDING_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_DIS_ROM_HIDING_DIS_ROM_HIDING_SHIFT (0U)
/*! DIS_ROM_HIDING - When 0x3CC35AA5 ROM hiding feture is disabled. All other values critical ROM is hidden.
 */
#define FLASH_NMPA_DIS_ROM_HIDING_DIS_ROM_HIDING(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_DIS_ROM_HIDING_DIS_ROM_HIDING_SHIFT)) & FLASH_NMPA_DIS_ROM_HIDING_DIS_ROM_HIDING_MASK)
/*! @} */

/*! @name PUF_SRAM -  */
/*! @{ */

#define FLASH_NMPA_PUF_SRAM_PUF_SRAM_VALID_MASK  (0x1U)
#define FLASH_NMPA_PUF_SRAM_PUF_SRAM_VALID_SHIFT (0U)
/*! PUF_SRAM_VALID - 1: PUF_SRAM is valid.
 */
#define FLASH_NMPA_PUF_SRAM_PUF_SRAM_VALID(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_PUF_SRAM_VALID_SHIFT)) & FLASH_NMPA_PUF_SRAM_PUF_SRAM_VALID_MASK)

#define FLASH_NMPA_PUF_SRAM_mode_MASK            (0x2U)
#define FLASH_NMPA_PUF_SRAM_mode_SHIFT           (1U)
/*! mode - PUF SRAM Controller operating mode
 */
#define FLASH_NMPA_PUF_SRAM_mode(x)              (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_mode_SHIFT)) & FLASH_NMPA_PUF_SRAM_mode_MASK)

#define FLASH_NMPA_PUF_SRAM_ckgating_MASK        (0x4U)
#define FLASH_NMPA_PUF_SRAM_ckgating_SHIFT       (2U)
/*! ckgating - PUF SRAM Clock Gating control
 */
#define FLASH_NMPA_PUF_SRAM_ckgating(x)          (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_ckgating_SHIFT)) & FLASH_NMPA_PUF_SRAM_ckgating_MASK)

#define FLASH_NMPA_PUF_SRAM_SMB_MASK             (0x300U)
#define FLASH_NMPA_PUF_SRAM_SMB_SHIFT            (8U)
/*! SMB - Source Biasing voltage.
 *  0b00..Low leakage.
 *  0b01..Medium leakage.
 *  0b10..Highest leakage.
 *  0b11..Disable.
 */
#define FLASH_NMPA_PUF_SRAM_SMB(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_SMB_SHIFT)) & FLASH_NMPA_PUF_SRAM_SMB_MASK)

#define FLASH_NMPA_PUF_SRAM_RM_MASK              (0x1C00U)
#define FLASH_NMPA_PUF_SRAM_RM_SHIFT             (10U)
/*! RM - Read Margin control settings.
 */
#define FLASH_NMPA_PUF_SRAM_RM(x)                (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_RM_SHIFT)) & FLASH_NMPA_PUF_SRAM_RM_MASK)

#define FLASH_NMPA_PUF_SRAM_WM_MASK              (0xE000U)
#define FLASH_NMPA_PUF_SRAM_WM_SHIFT             (13U)
/*! WM - Write Margin control settings.
 */
#define FLASH_NMPA_PUF_SRAM_WM(x)                (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_WM_SHIFT)) & FLASH_NMPA_PUF_SRAM_WM_MASK)

#define FLASH_NMPA_PUF_SRAM_WRME_MASK            (0x10000U)
#define FLASH_NMPA_PUF_SRAM_WRME_SHIFT           (16U)
/*! WRME - Write read margin enable.
 */
#define FLASH_NMPA_PUF_SRAM_WRME(x)              (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_WRME_SHIFT)) & FLASH_NMPA_PUF_SRAM_WRME_MASK)

#define FLASH_NMPA_PUF_SRAM_RAEN_MASK            (0x20000U)
#define FLASH_NMPA_PUF_SRAM_RAEN_SHIFT           (17U)
/*! RAEN - SRAM Read Assist Enable
 */
#define FLASH_NMPA_PUF_SRAM_RAEN(x)              (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_RAEN_SHIFT)) & FLASH_NMPA_PUF_SRAM_RAEN_MASK)

#define FLASH_NMPA_PUF_SRAM_RAM_MASK             (0x3C0000U)
#define FLASH_NMPA_PUF_SRAM_RAM_SHIFT            (18U)
/*! RAM - SRAM Read Assist settings
 */
#define FLASH_NMPA_PUF_SRAM_RAM(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_RAM_SHIFT)) & FLASH_NMPA_PUF_SRAM_RAM_MASK)

